src/Catalogs/ТипыТранспортныхСредств/ТипыТранспортныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыТранспортныхСредств</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоподъемностьВТоннах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВместимостьВКубическихМетрах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВместимостьПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ТипыТранспортныхСредств/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ВместимостьПредставление = "";
	ПробелВСередине = "";
	Если ЗначениеЗаполнено(ГрузоподъемностьВТоннах) Тогда
		ВместимостьПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 т';
																								|en = '%1 t'"), Строка(ГрузоподъемностьВТоннах));
		ПробелВСередине = " ";
	КонецЕсли;
	Если ЗначениеЗаполнено(ВместимостьВКубическихМетрах) Тогда
		ВместимостьПредставление = ВместимостьПредставление + ПробелВСередине
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 м3';
																			|en = '%1 m3'"), Строка(ВместимостьВКубическихМетрах));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
